from Graph1 import Graph1
from Graph2 import Graph2

'''
определяем граф списком смежности. Каждый узел графа представлен в виде ключа словаря, 
а его значения представлены в виде списка смежности, содержащего кортежи, в которых 
первый элемент - это узел-сосед, а второй элемент - это вес ребра, соединяющего 
данный узел с соседним узлом
'''
graph_dict = {
    'A': [('B', 5), ('C', 1), ('F', 15)],
    'B': [('A', 5), ('C', 2), ('E', 14), ('D', 1)], 
    'C': [('A', 1), ('B', 2), ('E', 8), ('D', 4)],
    'D': [('B', 1), ('C', 4), ('E', 3), ('F', 6)],
    'E': [('C', 8), ('B', 14), ('D', 3), ('F', 1)],
    'F': [('A', 15), ('D', 6), ('E', 1)]
}

graph1 = Graph1(graph_dict)
graph2 = Graph2(graph_dict)

print("BFS\n", graph1.bfs('A'))
print("DFS\n", graph1.dfs('A'))
print("Дейкстра\n", graph1.dijkstra('A'))
print("Прима\n", graph2.prim())
print("Крускала\n", graph1.kruskal())
print("Флойда-Уоршелла")
print(graph2.print_floyd_warshall())
